Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Src/fm33ht0xxa_fl_uart.c
    if(initStruct != NULL)
    {
        if(UARTx == UART0)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART0);
        }
        else if(UARTx == UART1)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART1);
        }
        else if(UARTx == UART2)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART2);
        }
        else if(UARTx == UART3)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART3);
        }
        else if(UARTx == UART4)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART4);
        }
        else if(UARTx == UART5)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART5);
        }
        else if(UARTx == UART6)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART6);
        }
        else if(UARTx == UART7)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART7);
        }
        else
        {
            return FL_FAIL;
        }
        /* 初始化参数 */
        FL_UART_SetTXIFMode(UARTx, initStruct->DmaTransmitInterrupt);
        if (FL_ENABLE == initStruct->ReceiveTimeOutEnable)
        {
            FL_UART_EnableRXTimeout(UARTx); 
        }
        else
        {
            FL_UART_DisableRXTimeout(UARTx);
        }
        FL_UART_WriteRXTimeout(UARTx, initStruct->ReceiveTimeOutLen);
        
        /* 以下参数LIN模式下不支持设置 */
        if (FL_UART_MODESEL_UART == FL_UART_GetMode(UARTx) || (UARTx == UART6) || (UARTx == UART7))
        {
            FL_UART_SetUARTMode(UARTx, initStruct->UartDuplex);
            if (FL_ENABLE == initStruct->ByteReSynEnable)
            {
                FL_UART_EnableResync(UARTx);
            }
            else
            {
                FL_UART_DisableResync(UARTx);
            }
            FL_UART_SetOverSampling(UARTx, initStruct->OverSamplingMode);
            if (FL_ENABLE == initStruct->RxFallWakeUpEnable)
            {
                FL_UART_EnableFallingEdgeWakeup(UARTx);
            }
            else
            {
                FL_UART_DisableFallingEdgeWakeup(UARTx);
            }
            FL_UART_SetBitOrder(UARTx, initStruct->BitOrder);
            FL_UART_WriteTXDelay(UARTx, initStruct->TransmitDelayLength);
        }
        return FL_PASS;
    }
    return FL_FAIL;
}

/**
  * @brief  根据需要配置LIN相关参数
  *
  * @param  UARTx  外设入口地址
  * @param  initStruct指向一个FL_UART_LIN_InitTypeDef类型的结构体,它包含外设UART关于LIN的配置信息
  *
  * @retval ErrorStatus枚举值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS UART配置成功
  */
FL_ErrorStatus FL_UART_LIN_Init(UART_Type *UARTx, FL_UART_LIN_InitTypeDef *initStruct)
{
    /* 参数入口合法性 */
    assert_param(IS_UART_LIN_INSTANCE(UARTx));  
    assert_param(IS_FL_UART_LIN_MODE(initStruct->linMode));
    assert_param(IS_FL_UART_LIN_WAKEUP_LENTH(initStruct->wakeupLenth));
    assert_param(IS_FL_UART_FUNSTATE_TYPE(initStruct->slaveSyncenable));
    assert_param(IS_FL_UART_FUNSTATE_TYPE(initStruct->frameTimeoutDetec));
    assert_param(IS_FL_UART_LIN_FRAME_TIMEOUT_LENTH(initStruct->frameTimeoutLenth));
    assert_param(IS_FL_UART_LIN_BUS_SEND_CONFL_DET(initStruct->busSendConflictDetec));
    assert_param(IS_FL_UART_FUNSTATE_TYPE(initStruct->busNoiseDetecEnable));
    assert_param(IS_FL_UART_FUNSTATE_TYPE(initStruct->wakeupDetecEnable));
    assert_param(IS_FL_UART_INTER_BYTE_SPACE(initStruct->interByteSpace));
    assert_param(IS_FL_UART_RESPONSE_SPACE(initStruct->responseSpace));
    assert_param(IS_FL_UART_BREAK_DELIMIT_LENTH(initStruct->breakDelimitLenth));
    assert_param(IS_FL_UART_BREAK_LENTH(initStruct->breakLenth));

    if(NULL != initStruct)
    {
        if(UARTx == UART0)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART0);
        }
        else if(UARTx == UART1)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART1);
        }
        else if(UARTx == UART2)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART2);
        }
        else if(UARTx == UART3)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART3);
        }
        else if(UARTx == UART4)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART4);
        }
        else if(UARTx == UART5)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_UART5);
        }
        else 
        {
            return FL_FAIL;
        }
        /* 设置LIN模式 */
        FL_UART_SetLINMode(UARTx, initStruct->linMode);
        FL_UART_SetMode(UARTx, FL_UART_MODESEL_NON_UART);
        /* 设置发送唤醒信号长度/接收唤醒信号识别阈值 */
        FL_UART_SetLINWkupLength(UARTx, initStruct->wakeupLenth);
        /* LIN从机Sync段接收使能/禁止 */
        if(initStruct->slaveSyncenable == FL_ENABLE)
        {
            FL_UART_EnableLINSlaveSyncReception(UARTx);
        }
        else
        {
            FL_UART_DisableLINSlaveSyncReception(UARTx);
        }
        /* LIN Frame timeout使能/禁止 */
        if(initStruct->frameTimeoutDetec == FL_ENABLE)
        {
            FL_UART_EnableLINFrameTimeoutDetect(UARTx);
        }
        else
        {
            FL_UART_DisableLINFrameTimeoutDetect(UARTx);
        }
        /* 设置帧超时长度 */
        FL_UART_WriteLINFrameTimeout(UARTx, initStruct->frameTimeoutLenth);
        
        /* LIN总线发送冲突检测配置 */
        FL_UART_SetLINBusErrorMode(UARTx, initStruct->busSendConflictDetec);
        /* LIN总线噪声监测使能/禁止 */
        if(initStruct->busNoiseDetecEnable == FL_ENABLE)
        {
            FL_UART_EnableLINNoiseDetect(UARTx);
        }
        else
        {
            FL_UART_DisableLINNoiseDetect(UARTx);
        }
        /* LIN唤醒信号检测使能/禁止 */
        if(initStruct->wakeupDetecEnable == FL_ENABLE)
        {
            /* 使能LIN工作时钟LSCSK=32768，用于唤醒信号检测 */
            FL_CMU_EnableOperationClock(FL_CMU_GROUP1_OPCLKEN_LINCKE);      
            FL_UART_EnableLINWkupDetect(UARTx);
        }
        else
        {
            FL_UART_DisableLINWkupDetect(UARTx);
            FL_CMU_DisableOperationClock(FL_CMU_GROUP1_OPCLKEN_LINCKE);
        }
        /* 填充数据发送时数据字节间隔，仅发送时有效  */
        FL_UART_WriteLINInterbyteSpace(UARTx, initStruct->interByteSpace);
        /* 填充header到发送数据respronse之间的间隔，仅发送时有效 */
        FL_UART_WriteLINResponseSpace(UARTx, initStruct->responseSpace);
        /* 填充break界定符长度 */
        FL_UART_WriteLINBreakSpace(UARTx, initStruct->breakDelimitLenth);
        /* 填充 break长度 */
        FL_UART_WriteLINBreakLength(UARTx, initStruct->breakLenth);
        return FL_PASS;
    }
    return FL_FAIL;
}

/**
  * @brief  UART_InfraRed_InitStruct 为默认配置
  * @param  UART_InitStruct 指向需要将值设置为默认配置 的结构体@ref FL_UART_InfraRed_InitTypeDef 结构体
  *
  * @retval None
  */
void FL_UART_InfraRed_StructInit(FL_UART_InfraRed_InitTypeDef *initStruct)
{
    if(initStruct != NULL)
    {
        initStruct->polarity            = FL_UART_INFRARED_POLARITY_NORMAL;
        initStruct->modulationDuty      = 50;
        initStruct->modulationFrequency = 38000;
    }
}

/**
  * @brief  UART_InitStruct 为默认配置
  * @param  UART_InitStruct 指向需要将值设置为默认配置 的结构体@ref FL_UART_InitTypeDef structure 结构体
  *         
  * @retval None
  */
void FL_UART_StructInit(FL_UART_InitTypeDef *initStruct)
{
    if(initStruct != NULL)
    {
        initStruct->baudRate          = 115200;
        initStruct->dataWidth         = FL_UART_DATA_WIDTH_8B;
        initStruct->stopBits          = FL_UART_STOP_BIT_WIDTH_1B;
        initStruct->parity            = FL_UART_PARITY_EVEN ;
        initStruct->transferDirection = FL_UART_DIRECTION_TX_RX;
        initStruct->clockSrc          = 0;
    }
}

/**
  * @brief  UART_ExtendedPrm_InitStruct 为默认配置
  * @param  UART_InitStruct 指向需要将值设置为默认配置 的结构体@ref FL_UART_ExtendedPrm_InitTypeDef structure 结构体
  *         
  * @retval None
  */
void FL_UART_ExtendedPrm_StructInit(FL_UART_ExtendedPrm_InitTypeDef *initStruct)
{
    if(initStruct != NULL)
    {
        initStruct->DmaTransmitInterrupt = FL_UART_TXIF_MODE_ALWAYS;
        initStruct->ReceiveTimeOutEnable = FL_DISABLE;
        initStruct->ReceiveTimeOutLen    = 255;
        /* 以下参数LIN模式下不支持 */  
        initStruct->UartDuplex           = FL_UART_UART_MODESEL_FULL_DUPLEX;
        initStruct->ByteReSynEnable      = FL_DISABLE;
        initStruct->OverSamplingMode     = FL_UART_OVERSAMPLING_16;
        initStruct->RxFallWakeUpEnable   = FL_DISABLE; 
        initStruct->BitOrder             = FL_UART_BIT_ORDER_LSB_FIRST;
        initStruct->TransmitDelayLength  = 0x0;
    }
}

/**
  * @brief  UART_LIN_InitStruct 为默认配置
  * @param  UART_LIN_InitStruct 指向需要将值设置为默认配置 的结构体@ref FL_UART_LIN_InitTypeDef 结构体
  *         
  * @retval None
  */
void FL_UART_LIN_StructInit(FL_UART_LIN_InitTypeDef *initStruct)
{
    if(initStruct != NULL)
    {
        initStruct->linMode              = FL_UART_LIN_MODESEL_SLAVE;
        initStruct->wakeupLenth          = 9 - 1;
        initStruct->slaveSyncenable      = FL_ENABLE;
        initStruct->frameTimeoutDetec    = FL_DISABLE ;
        initStruct->frameTimeoutLenth    = 256 - 1;
        initStruct->busSendConflictDetec = FL_UART_BER_MODE_NONE;
        initStruct->busNoiseDetecEnable  = FL_DISABLE;
        initStruct->wakeupDetecEnable    = FL_DISABLE;
        initStruct->interByteSpace       = 0;
        initStruct->responseSpace        = 0;
        initStruct->breakDelimitLenth    = 0;
        initStruct->breakLenth           = 0;
    }
}

/**
  * @}
  */

#endif /* FL_UART_DRIVER_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/********************** (C) COPYRIGHT Fudan Microelectronics **** END OF FILE ***********************/






